1:WizQst14DBD9
00000000

I asked you to go and study the Arcanum Creed. Have you forgotten or given up? I'm feeling... unimpressed.
00000001

You recall my concerns about Shadow Magic? Well, unsurprisingly, I was right. In fact, it's worse. Started as a trickle but now it's a flood.
00000002

We have much to discuss, but first, who is this with you? I'm sure I've told you before. New people make me nervous, especially young ones.
00000003

Young, but an experienced Wizard nonetheless, invited here as my guest. I believe this one could be a valuable ally to the Arcanum.
00000004

Hmmph. I'm skeptical, a little irritated even, but all right. Wizard, we don't allow tourists here. You will be an Initiate... for now.
00000005

You must begin by going to the Repository to study the Arcanum Creed. That will give Baba Yaga and myself time to... catch up.
00000006

<ITALICS>The Repository reeks of musty old scrolls and dry binding glue. The Arcanum Creed is engraved in massive glyphs on the wall. </ITALICS>
00000007

<ITALICS>To translate each of the glyphs, you'll need to consult the ancient tomes set out on this level. </ITALICS> 
00000008

<ITALICS>Within the tome, you find a translation for the first glyph. "In the Order, a Spiral." </ITALICS>
00000009

<ITALICS>Within the tome, you find a translation for the second glyph. "In the Spiral, a Magic." </ITALICS>
00000010

<ITALICS>Within the tome, you find a translation for the third glyph. "In the Magic, an Eternity." </ITALICS>
00000011

<ITALICS>Within the tome, you find a translation for the fourth glyph. "In the Eternity, a Truth." </ITALICS>
00000012

<ITALICS>Together, the glyphs read: In the Order, a Spiral. In the Spiral, a Magic. In the Magic, an Eternity. In the Eternity, a Truth. </ITALICS>
00000013

<ITALICS>After reading the Creed, you feel a strong sense of belonging, as if you were meant to be here. </ITALICS>
00000014

So you managed to figure out the Creed. I feel surprise, but not disappointment. Perhaps Baba Yaga's assessment was not entirely wrong. 
00000015

Repository
00000016

Tome of Creation
00000017

Tome of Knowledge
00000018

Tome of Inspiration
00000019

Tome of Insight
